
class URL:
    url_scooter = "https://qa-scooter.praktikum-services.ru/"

class UserData:
    user_1_info = {'name' : 'Петр',
                   'surname' : 'Зеленухин',
                   'adress' : 'Береговая,11',
                   'metro_station' : 'Соколиная гора',
                   'phone' : 89566542121,
                   'rent_date' : '08.03.26',
                   'rent_comment' : 'Все супер пупер'
                  }
    
    user_2_info = {'name' : 'Витя',
                   'surname' : 'Ломовой',
                   'adress' : 'Пробойная,17',
                   'metro_station' : 'Комсомольская',
                   'phone' : 89452543232,
                   'rent_date' : '05.03.26',
                   'rent_comment' : 'Все не супер пупер'
                  }
class AnswerText:
    how_much_how_pay_answer_text = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    many_scooters_answer_text = 'Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим.'
    rent_time_answer_text = 'Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.'
    scooter_today_answer_text = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    rent_set_answer_text = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    scooter_charge_answer_text = 'Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится.'
    cancellation_answer_text = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    mordor_habitation_answer_text = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'   

